from fake_useragent import UserAgent #line:2
import requests #line:3
import random #line:4
from termcolor import colored #line:5
import pyfiglet #line:6
number =+79999999999 #line:8
ascii_banner =pyfiglet .figlet_format ("GEROIN")#line:12
colored_banner =colored (ascii_banner ,color ='red')#line:13
def generate_phone_number ():#line:15
    O0OOO000O00O00OOO =['+7','+380','+375']#line:17
    OO0O0OOOOOO000000 =random .choice (O0OOO000O00O00OOO )#line:20
    O00OOO00OO00O0000 =''.join (random .choices ('0123456789',k =10 ))#line:23
    O000OOOOOO00OOOOO =f'{OO0O0OOOOOO000000}{O00OOO00OO00O0000}'#line:25
    return O000OOOOOO00OOOOO #line:27
import string #line:29
def generate_random_email ():#line:31
    OO000OOOO00000O00 =["gmail.com","yahoo.com","outlook.com","hotmail.com","mail.ru"]#line:34
    OO00OO0OOO00OOOOO =''.join (random .choice (string .ascii_lowercase )for _O0OO0000000O0O00O in range (8 ))#line:36
    O0O0OO0OO00O000O0 =random .choice (OO000OOOO00000O00 )#line:37
    OO0O000O0O0O0O0O0 =f"{OO00OO0OOO00OOOOO}@{O0O0OO0OO00O000O0}"#line:39
    return OO0O000O0O0O0O0O0 #line:41
def generate_phone_number1 ():#line:43
    OO00OO00O0OO000O0 =['+7','+380','+375']#line:45
    OO00OO00OO0O00OOO =random .choice (OO00OO00O0OO000O0 )#line:48
    O0O0O00O0OOOOOOOO =''.join (random .choices ('0123456789',k =10 ))#line:50
    OOO00O00OO0OOO0O0 =f'{OO00OO00OO0O00OOO}{O0O0O00O0OOOOOOOO}'#line:53
    return OOO00O00OO0OOO0O0 #line:55
def generate_random_email1 ():#line:57
    O0000000000O00000 =["gmail.com","yahoo.com","outlook.com","hotmail.com","mail.ru"]#line:58
    OO000OO00O0O000OO =''.join (random .choice (string .ascii_lowercase )for _OOO0OOO00OO0O0O00 in range (8 ))#line:60
    O0O00OO00000O0O00 =random .choice (O0000000000O00000 )#line:61
    OO0O00O00000OOO0O =f"{OO000OO00O0O000OO}@{O0O00OO00000O0O00}"#line:63
    return OO0O00O00000OOO0O #line:65
def send_complaint (OOOO0OO00000O000O ,OO0000000O000O0OO ,OO0O00O0OO0000OO0 ,O000OOOO0OOO00OO0 ,OOOOO0O00O000000O ,O00OOO00OOOO000O0 ,OOO0OOO0OOO0OOO00 =None ):#line:67
	O0O0O000OOOO0O0O0 ='https://telegram.org/support'#line:68
	OO0OOOOOO0O0OO0OO =UserAgent ().random #line:69
	O0OO0000O0O000OO0 ={'User-Agent':OO0OOOOOO0O0OO0OO }#line:70
	O0OO0OO0O00O0OO0O =0 #line:71
	if O00OOO00OOOO000O0 =="1":#line:73
		OOOOOO0OO0O00O0O0 =f'Добрый день поддержка Telegram! Аккаунт {OOOO0OO00000O000O}, {OO0000000O000O0OO} использует виртуальный номер купленный на сайте по активации номеров. Отношения к номеру он не имеет, номер никак к нему не относиться.Прошу разберитесь с этим. Заранее спасибо!'#line:74
	elif O00OOO00OOOO000O0 =="2":#line:75
		OOOOOO0OO0O00O0O0 =f'Аккаунт {OOOO0OO00000O000O}, {OO0000000O000O0OO} приобрёл премиум в вашем сервисе чтобы обходить наказания за спам и совершает спам-рассылки в личные сообщения пользователям и в чаты. Прошу проверить информацию!'#line:76
	elif O00OOO00OOOO000O0 =="3":#line:77
		OOOOOO0OO0O00O0O0 =f"Здраствуйте. Аккаунт {OOOO0OO00000O000O}, id {OO0000000O000O0OO} оскорбляет меня и мою маму. Мне это очень не приятно, поэтому и пишу вам. Огромная прозьба разобраться и заблокировать данного пользователя т.к это нарушает политику сервиса. Блгаодарю"#line:78
	elif O00OOO00OOOO000O0 =="4":#line:79
		OOOOOO0OO0O00O0O0 =f"Здраствуйте. Аккаунт {OOOO0OO00000O000O}, id {OO0000000O000O0OO}. Очень много и частно нарушает политику сервиса Телеграмм. А именно, оскорбляет, сливает личные данные юзеров. Продает различные услуги. Прозьба разобраться и наказать данный аккаунт."#line:80
	elif O00OOO00OOOO000O0 =="5":#line:82
		OOOOOO0OO0O00O0O0 =f"Здравствуйте, я утерял свой телеграм-аккаунт путем взлома. Я попался на фишинговую ссылку, и теперь на моем аккаунте сидит какой-то человек. Он установил облачный пароль, так что я не могу зайти в свой аккаунт и прошу о помощи. Мой юзернейм — {OOOO0OO00000O000O}, а мой айди, если злоумышленник поменял юзернейм —  {OO0000000O000O0OO} . Пожалуйста, перезагрузите сессии или удалите этот аккаунт, так как у меня там очень много важных данных."#line:83
	elif O00OOO00OOOO000O0 =="6":#line:84
		OOOOOO0OO0O00O0O0 =f"Здраствуйте, сидя на просторах сети телеграмм, я заметил пользователя который совершает спам-рассылки, мне и другим пользователям это очень не нравится.Его аккаунт: {OOOO0OO00000O000O}, ID {OO0000000O000O0OO}.Огромная прозьба разобраться с этим и заблокировать данного пользователя. Заранее спасибо."#line:85
	elif O00OOO00OOOO000O0 =="7":#line:87
		OOOOOO0OO0O00O0O0 =f"Сидя на просторах телеграмма заметил юзера который продает услуги dеаnонa и лжеминирования, сыллка на канал и юзер админа: {OOOO0OO00000O000O}, id админа: {OO0000000O000O0OO}. Большая прозьба заблокировать канал и пользователя, т.к это нарушает политику сервиса."#line:88
	elif O00OOO00OOOO000O0 =="8":#line:90
		OOOOOO0OO0O00O0O0 =f"На сервисе telegram обнаружил пользователя который накручивает на канал реакции, подписки и просмотры. Сыллка на посты с накруткой и аккаунт администратора: {OOOO0OO00000O000O}, id администратора на случай если поменяет юзернейм: {OO0000000O000O0OO}. Прозьба разобраться и заблокировать пользователя т.к это нарушает правила telegramm"#line:91
	O0OO0O0O000000OO0 ={'text':OOOOOO0OO0O00O0O0 ,'number':OO0O00O0OO0000OO0 ,'email':O000OOOO0OOO00OO0 }#line:93
	try :#line:95
		for _OO00OO0OOOOO000O0 in range (int (OOOOO0O00O000000O )):#line:96
			OOOO00O00OOO0OOO0 =requests .post (O0O0O000OOOO0O0O0 ,headers =O0OO0000O0O000OO0 ,data =O0OO0O0O000000OO0 ,proxies =OOO0OOO0OOO0OOO00 )#line:97
			if OOOO00O00OOO0OOO0 .status_code ==200 :#line:98
				O0OO0OO0O00O0OO0O +=1 #line:99
				print (colored (f"Жалоба успешно отправлена",'green'))#line:100
				print (colored (f"От: {O000OOOO0OOO00OO0} {OO0O00O0OO0000OO0}",'cyan'))#line:101
			else :#line:102
				print ("Не удалось отправить. code:",OOOO00O00OOO0OOO0 .status_code )#line:103
	except Exception as O0O0O000O0O000O00 :#line:104
		print ("An error occurred:",str (O0O0O000O0O000O00 ))#line:105
def complaint ():#line:113
	print (colored_banner )#line:114
	print (colored ("[1] Виртуальный номер","magenta"))#line:115
	print (colored ("[2] Премиум","magenta"))#line:116
	print (colored ("[3] Оскорбление","magenta"))#line:117
	print (colored ("[4] Нарушение правил","magenta"))#line:118
	print (colored ("[5] Сессий","magenta"))#line:119
	print (colored ("[6] Спам","magenta"))#line:120
	print (colored ("[7] Прайс","magenta"))#line:121
	print (colored ("[8] Накрутка","magenta"))#line:122
	O00O0OO00OO0OOO00 =input (colored ("Введите номер: ","magenta"))#line:123
	if O00O0OO00OO0OOO00 in ["1","2","3","4","6","7","8"]:#line:125
		OO0OO0OO00O0O000O =input ("Введите @username: ")#line:126
		O000000O00O0O0O0O =input ("Введите Telegram ID: ")#line:127
		OOO0OO000O000O00O =int (input ("Введите количество жалоб: "))#line:128
		for _O00OO0O000OO00000 in range (OOO0OO000O000O00O ):#line:129
			OO00OOOOO00OOO0OO =generate_phone_number ()#line:130
			O0000OO0OOO0OOO00 =generate_random_email ()#line:131
			O00OOO00O00OOO0O0 =['8.218.149.193:80','47.57.233.126:80','47.243.70.197:80','8.222.193.208:80','144.24.85.158:80','47.245.115.6:80','47.245.114.163:80' '45.4.55.10:40486','103.52.37.1:4145','200.34.227.204:4153','190.109.74.1:33633','200.54.221.202:4145','36.67.66.202:5678','168.121.139.199:4145','101.255.117.2:51122','45.70.0.250:4145','78.159.199.217:1080','67.206.213.202:4145','14.161.48.4:4153','119.10.179.33:5430','109.238.222.1:4153','103.232.64.226:4145','183.88.212.247:1080','116.58.227.197:4145','1.20.97.181:34102','103.47.93.214:1080','89.25.23.211:4153','185.43.249.132:39316','188.255.209.149:1080','178.216.2.229:1488','92.51.73.14:4153','109.200.156.2:4153','89.237.33.193:51549','211.20.145.204:4153','45.249.79.185:3629','208.113.223.164:21829','62.133.136.75:4153','46.99.135.154:4153','1.20.198.254:4153','196.6.234.140:4153','118.70.196.124:4145','185.34.22.225:46169','103.47.93.199:1080','222.129.34.122:57114','92.247.127.249:4153','186.150.207.141:1080','202.144.201.197:43870','103.106.32.105:31110','200.85.137.46:4153','116.58.254.9:4145','101.51.141.122:4153','83.69.125.126:4145','187.62.88.9:4153','122.54.134.176:4145','170.0.203.11:1080','187.4.165.90:4153','159.224.243.185:61303','103.15.242.216:55492','187.216.81.183:37640','176.197.100.134:3629','101.51.105.41:4145','46.13.11.82:4153','103.221.254.125:40781','177.139.130.157:4153','1.10.189.133:50855','69.70.59.54:4153','83.103.195.183:4145','190.109.168.241:42732','103.76.20.155:43818','84.47.226.66:4145','1.186.60.25:4153','93.167.67.69:4145','202.51.112.22:5430','213.6.204.153:42820','184.178.172.14:4145','217.171.62.42:4153','121.13.229.213:61401','101.255.140.101:1081','78.189.64.42:4145','187.11.232.71:4153','190.184.201.146:32606','195.34.221.81:4153','200.29.176.174:4145','103.68.35.162:4145','194.135.97.126:4145','167.172.123.221:9200','200.218.242.89:4153','190.7.141.66:40225','186.103.154.235:4153','118.174.196.250:4153','213.136.89.190:52010','217.25.221.60:4145','50.192.195.69:39792','180.211.162.114:44923','179.1.1.11:4145','41.162.94.52:30022','103.211.11.13:52616','103.209.65.12:6667','101.51.121.29:4153','190.13.82.242:4153','103.240.33.185:8291','202.51.100.33:5430','201.220.128.92:3000','177.11.75.18:51327','62.122.201.170:31871','79.164.171.32:50059','202.124.46.97:4145','79.132.205.34:61731','217.29.18.206:4145','222.217.68.17:35165','105.29.95.34:4153','103.226.143.254:1080','119.82.251.250:31678','45.232.226.137:52104','195.69.218.198:60687','155.133.83.161:58351','213.108.216.59:1080','178.165.91.245:3629','124.158.150.205:4145','36.72.118.156:4145','177.93.79.18:4145','103.47.94.97:1080','78.140.7.239:40009','187.19.150.221:80','103.192.156.171:4145','36.67.27.189:49524','188.136.167.33:4145','91.226.5.245:36604','78.90.81.184:42636','189.52.165.134:1080','81.183.253.34:4145','95.154.104.147:31387','220.133.209.253:4145','182.52.108.104:14153','195.93.173.24:9050','170.244.64.129:31476','117.102.124.234:4145','190.210.3.210:1080','182.253.142.11:4145','176.98.156.64:4145','210.48.139.228:4145','177.39.218.70:4153','112.78.134.229:41517','119.46.2.245:4145','103.212.94.253:41363','190.109.72.41:33633','103.94.133.94:4153','190.151.94.2:56093','190.167.220.7:4153','94.136.154.53:60030','103.206.253.59:53934','69.163.160.185:29802','213.6.221.162:5678','96.9.86.70:53304','202.182.54.186:4145','192.140.42.83:59057','138.121.198.90:42494','190.121.142.166:4153','190.0.242.217:51327','103.35.108.145:4145','82.114.83.238:4153','195.22.253.235:4145','91.219.100.72:4153','212.3.109.7:4145','45.7.177.226:39867','202.5.37.241:49151','195.9.89.66:3629','190.186.1.46:33567','69.163.161.118:20243']#line:300
			OOOO00O00O000O0OO ={'http':random .choice (O00OOO00O00OOO0O0 )}#line:301
			send_complaint (OO0OO0OO00O0O000O ,O000000O00O0O0O0O ,OO00OOOOO00OOO0OO ,O0000OO0OOO0OOO00 ,1 ,O00O0OO00OO0OOO00 ,OOOO00O00O000O0OO )#line:302
	elif O00O0OO00OO0OOO00 =='5':#line:303
		OO0OO0OO00O0O000O =input ("Введите юзернейм: ")#line:304
		O000000O00O0O0O0O =input ("Введите Telegram ID: ")#line:305
		OOO0OO000O000O00O =int (input ("Введите количество жалоб: "))#line:306
		OO00OOOOO00OOO0OO =input ("Введите номер телефона аккаунта: ")#line:307
		O0000OO0OOO0OOO00 =generate_random_email ()#line:308
		O00OOO00O00OOO0O0 =['8.218.149.193:80','47.57.233.126:80','47.243.70.197:80','8.222.193.208:80','144.24.85.158:80','47.245.115.6:80','47.245.114.163:80' '45.4.55.10:40486','103.52.37.1:4145','200.34.227.204:4153','190.109.74.1:33633','200.54.221.202:4145','36.67.66.202:5678','168.121.139.199:4145','101.255.117.2:51122','45.70.0.250:4145','78.159.199.217:1080','67.206.213.202:4145','14.161.48.4:4153','119.10.179.33:5430','109.238.222.1:4153','103.232.64.226:4145','183.88.212.247:1080','116.58.227.197:4145','1.20.97.181:34102','103.47.93.214:1080','89.25.23.211:4153','185.43.249.132:39316','188.255.209.149:1080','178.216.2.229:1488','92.51.73.14:4153','109.200.156.2:4153','89.237.33.193:51549','211.20.145.204:4153','45.249.79.185:3629','208.113.223.164:21829','62.133.136.75:4153','46.99.135.154:4153','1.20.198.254:4153','196.6.234.140:4153','118.70.196.124:4145','185.34.22.225:46169','103.47.93.199:1080','222.129.34.122:57114','92.247.127.249:4153','186.150.207.141:1080','202.144.201.197:43870','103.106.32.105:31110','200.85.137.46:4153','116.58.254.9:4145','101.51.141.122:4153','83.69.125.126:4145','187.62.88.9:4153','122.54.134.176:4145','170.0.203.11:1080','187.4.165.90:4153','159.224.243.185:61303','103.15.242.216:55492','187.216.81.183:37640','176.197.100.134:3629','101.51.105.41:4145','46.13.11.82:4153','103.221.254.125:40781','177.139.130.157:4153','1.10.189.133:50855','69.70.59.54:4153','83.103.195.183:4145','190.109.168.241:42732','103.76.20.155:43818','84.47.226.66:4145','1.186.60.25:4153','93.167.67.69:4145','202.51.112.22:5430','213.6.204.153:42820','184.178.172.14:4145','217.171.62.42:4153','121.13.229.213:61401','101.255.140.101:1081','78.189.64.42:4145','187.11.232.71:4153','190.184.201.146:32606','195.34.221.81:4153','200.29.176.174:4145','103.68.35.162:4145','194.135.97.126:4145','167.172.123.221:9200','200.218.242.89:4153','190.7.141.66:40225','186.103.154.235:4153','118.174.196.250:4153','213.136.89.190:52010','217.25.221.60:4145','50.192.195.69:39792','180.211.162.114:44923','179.1.1.11:4145','41.162.94.52:30022','103.211.11.13:52616','103.209.65.12:6667','101.51.121.29:4153','190.13.82.242:4153','103.240.33.185:8291','202.51.100.33:5430','201.220.128.92:3000','177.11.75.18:51327','62.122.201.170:31871','79.164.171.32:50059','202.124.46.97:4145','79.132.205.34:61731','217.29.18.206:4145','222.217.68.17:35165','105.29.95.34:4153','103.226.143.254:1080','119.82.251.250:31678','45.232.226.137:52104','195.69.218.198:60687','155.133.83.161:58351','213.108.216.59:1080','178.165.91.245:3629','124.158.150.205:4145','36.72.118.156:4145','177.93.79.18:4145','103.47.94.97:1080','78.140.7.239:40009','187.19.150.221:80','103.192.156.171:4145','36.67.27.189:49524','188.136.167.33:4145','91.226.5.245:36604','78.90.81.184:42636','189.52.165.134:1080','81.183.253.34:4145','95.154.104.147:31387','220.133.209.253:4145','182.52.108.104:14153','195.93.173.24:9050','170.244.64.129:31476','117.102.124.234:4145','190.210.3.210:1080','182.253.142.11:4145','176.98.156.64:4145','210.48.139.228:4145','177.39.218.70:4153','112.78.134.229:41517','119.46.2.245:4145','103.212.94.253:41363','190.109.72.41:33633','103.94.133.94:4153','190.151.94.2:56093','190.167.220.7:4153','94.136.154.53:60030','103.206.253.59:53934','69.163.160.185:29802','213.6.221.162:5678','96.9.86.70:53304','202.182.54.186:4145','192.140.42.83:59057','138.121.198.90:42494','190.121.142.166:4153','190.0.242.217:51327','103.35.108.145:4145','82.114.83.238:4153','195.22.253.235:4145','91.219.100.72:4153','212.3.109.7:4145','45.7.177.226:39867','202.5.37.241:49151','195.9.89.66:3629','190.186.1.46:33567','69.163.161.118:20243']#line:477
		OOOO00O00O000O0OO ={'http':random .choice (O00OOO00O00OOO0O0 )}#line:478
		send_complaint (OO0OO0OO00O0O000O ,O000000O00O0O0O0O ,OO00OOOOO00OOO0OO ,O0000OO0OOO0OOO00 ,OOO0OO000O000O00O ,O00O0OO00OO0OOO00 ,OOOO00O00O000O0OO )#line:479
	else :#line:480
		print ("Некорректная причина")#line:481
complaint ()